eisup_2019_docmng_integration/src/Reports/абс_ОтчетПоПланамПлатежейЗаПроизвольныйПериод/абс_ОтчетПоПланамПлатежейЗаПроизвольныйПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>абс_ОтчетПоПланамПлатежейЗаПроизвольныйПериод</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПланаПлатежей/абс_СтатусыПланаПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПланаПлатежей</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Разутвержден</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыДвиженийДенежныхСредств/ВидыДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийДенежныхСредств</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>АрендныеПлатежиРоялтиЛицензионныеПлатежиГонорарыКомиссионные</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаДивидендов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаПроцентовВСвязиСоСтроительством</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускДолговыхИнструментов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаОборотныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтЗаймовИКредитовПредоставленныхДругимиОрганизациями</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтЭмиссииАкций</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеПоступленияПоИнвестиционнойДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеПоступленияПоТекущейДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеПоступленияПоФинансовойДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходыПоИнвестиционнойДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходыПоТекущейДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходыПоФинансовойДеятельности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СредстваПолученныеОтПокупателейИЗаказчиков</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыкупСобственныхАкций</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыкупСобственныхДолевыхИнструментов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаДивидендовПроцентов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаДолиМеньшинства</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаПроцентовФинансовая</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускКомплексныхФинансовыхИнструментов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажиДоходныхВложений</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажиНематериальныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажиОбъектовОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажиЦенныхБумагИИныхФинансовыхВложений</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЗаймыПредоставленныеДругимОрганизациям</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаНИОКР</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаПоПенсионнымПланам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймовИКредитов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеОбязательствПоФинансовойАренде</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПолученныеДивиденды</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПолученныеПроценты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПлатежейПоФинансовойАренде</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтПогашенияЗаймовПредоставленныхДругимОрганизациям</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеДоходныхВложенийВМатериальныеЦенности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеДочернихОрганизаций</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеНематериальныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеОбъектовОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеПрочихАктивовИнвестиционное</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПриобретениеЦенныхБумагИИныхФинансовыхВложений</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасчетыПоНалогамИСборам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияПрочихАктивовИнвестиционная</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаПроцентовПоДолговымОбязательствам</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажиВнеоборотныхАктивовКромеФинансовых</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ПлатежиСобственникамВСвязиСВыкупомАкцийИлиПриВыходеИзСоставаУчастников</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеДолговыйЦенныхБумагВозвратКредитовИЗаймов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхВкладовСобственников</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОтДивидендовПроцентовПоДолговымФинансовымВложениям</name>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтПерепродажиФинансовыхВложений</name>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтПогашенияЗаймовПродажиДолговыхЦенныхБумаг</name>
  </enumValues>
  <enumValues>
    <name>ПоступленияОтПродажиАкцийДругихОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеАкцийДругихОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеДолговыхЦенныхБумагПредоставлениеЗаймов</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеСозданиеМодернизацияРеконструкцияВнеоборотныхАктивов</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_Платеж/абс_Платеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_Платеж</name>
  <basedOn>Document.ЗаявкаНаРасходованиеСредств</basedOn>
  <registerRecords>AccumulationRegister.абс_ПланПлатежей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>CatalogRef.абс_НазначенияПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяКатегория</name>
    <type>
      <types>CatalogRef.абс_КатегорииБС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПлана</name>
    <type>
      <types>EnumRef.абс_СтатусыПланаПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлатежей</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаОплату</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочныйЗаказ</name>
      <type>
        <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияБС</name>
      <type>
        <types>CatalogRef.абс_КатегорииБС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>CatalogRef.абс_НазначенияПлатежа</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>DocumentRef.абс_СчетНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>DocumentRef.абс_Оплата</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Reports/абс_ОтчетПоПланамПлатежейЗаПроизвольныйПериод/ObjectModule.bsl
Процедура Печать() Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПланПлатежей");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокРазмер10 = Макет.ПолучитьОбласть("ЗаголовокРазмер10");
	ОбластьЗаголовокРазмер11 = Макет.ПолучитьОбласть("ЗаголовокРазмер11");
	ОбластьГруппаПоступления = Макет.ПолучитьОбласть("ГруппаПоступления");
	ОбластьСтрокаПоКонтрагенту = Макет.ПолучитьОбласть("СтрокаПоКонтрагенту");
	ОбластьИтогиПоКонтрагенту1 = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту1");
	ОбластьИтогиПоКонтрагенту2 = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту2");
	ОбластьИтогиПоКонтрагенту3 = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту3");
	ОбластьИтогиПоКонтрагенту4 = Макет.ПолучитьОбласть("ИтогиПоКонтрагенту4");
	ОбластьИтогиПоВиду = Макет.ПолучитьОбласть("ИтогиПоВиду");
	ОбластьИтогиПоВидуДеятельности = Макет.ПолучитьОбласть("ИтогиПоВидуДеятельности");
	ОбластьГруппаФинансоваяДеятельность = Макет.ПолучитьОбласть("ГруппаФинансоваяДеятельность");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаНераспределенные = Макет.ПолучитьОбласть("ШапкаНераспределенные");
	ОбластьСтрокаНераспределенные = Макет.ПолучитьОбласть("СтрокаНераспределенные");
	
	ВалютаДоллар = Справочники.Валюты.НайтиПоКоду("840");
	ВалютаЕвро = Справочники.Валюты.НайтиПоКоду("978");
	СписокВалют = Новый СписокЗначений;
	СписокВалют.Добавить(ВалютаДоллар);
	СписокВалют.Добавить(ВалютаЕвро);
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	абс_ПлановыйКурсы.Валюта,
	//|	абс_ПлановыйКурсы.ПлановыйКурс
	//|ИЗ
	//|	РегистрСведений.абс_ПлановыйКурсы КАК абс_ПлановыйКурсы
	//|ГДЕ
	//|	абс_ПлановыйКурсы.НомерНедели = &НомерНедели
	//|	И абс_ПлановыйКурсы.Валюта В(&Валюты)";
	//
	//Запрос.УстановитьПараметр("НомерНедели", НомерНедели);
	//Запрос.УстановитьПараметр("Валюты", СписокВалют);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Валюта = ВалютаДоллар Тогда
	//		ОбластьШапка.Параметры.КурсДоллар = Выборка.ПлановыйКурс;
	//	ИначеЕсли Выборка.Валюта = ВалютаЕвро Тогда
	//		ОбластьШапка.Параметры.КурсЕвро = Выборка.ПлановыйКурс;
	//	КонецЕсли;
	//КонецЦикла;
	
	//ОбластьШапка.Параметры.НомерНедели = НомерНедели-1;
	ОбластьШапка.Параметры.Период = Формат(ДатаНачала,  "ДФ=MM.dd") + "/" + Формат(ДатаОкончания, "ДФ=MM.dd"); 
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "ОПЕРАЦИОННАЯ ДЕЯТЕЛЬНОСТЬ.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	ТабличныйДокумент.Вывести(ОбластьГруппаПоступления);
	
	ОбластьЗаголовокРазмер11.Параметры.Заголовок = "Расходы.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер11);
	
	ИтогиРасходыОперационнаяДеятельность = 0;
	ИтогиРасходыИнвестиционнаяДеятельность = 0;
	
	ЦФУ_Строительство = Справочники.абс_ЦФУ.НайтиПоКоду("ЦФУ4");
	ЦФУ_Связь = Справочники.абс_ЦФУ.НайтиПоКоду("ЦФУ123");
	ЦФУ_Эксплуатация = Справочники.абс_ЦФУ.НайтиПоКоду("ЦФУ5");
	
	БюджетныеСтатьиСтроительство = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСт");
	БюджетныеСтатьиЭксплуатация = Новый Массив;
	БюджетныеСтатьиЭксплуатация.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРЭ"));
	БюджетныеСтатьиЭксплуатация.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСЭ"));
	БюджетныеСтатьиСвязь = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСП");
	БюджетныеСтатьиСИ = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСи");
	БюджетныеСтатьиКапвложения = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВ");
	
	БюджетныеСтатьиПРСт010203 = Новый СписокЗначений;
	БюджетныеСтатьиПРСт010203.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСТ01"));
	БюджетныеСтатьиПРСт010203.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСТ02"));
	БюджетныеСтатьиПРСт010203.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСТ03"));
	
	БюджетныеСтатьиПРСЭ0101_0102 = Новый СписокЗначений;
	БюджетныеСтатьиПРСЭ0101_0102.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСЭ0101"));
	БюджетныеСтатьиПРСЭ0101_0102.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПРСЭ0102"));
	
	БюджетныеСтатьиКосвенныеПрочие = Новый СписокЗначений;
	БюджетныеСтатьиКосвенныеПрочие.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КОС"));
	БюджетныеСтатьиКосвенныеПрочие.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("ПрР"));
	
	ВыведенныеСтроки = Новый ТаблицаЗначений;
	ВыведенныеСтроки.Колонки.Добавить("НомерСтроки");
	ВыведенныеСтроки.Колонки.Добавить("Документ");
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Прочие строительные программы. Х-ТТК.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В (&БюджетныеСтатьиПРСТ010203))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент";
	
	
	//Запрос.УстановитьПараметр("НомерНедели", НомерНедели);
	//Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала)); 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	////
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Строительство);
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиСтроительство);
	Запрос.УстановитьПараметр("БюджетныеСтатьиПРСт010203", БюджетныеСтатьиПРСт010203);
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоКонтрагенту = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			ВыборкаПоСтрокам = ВыборкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
				ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
				НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
				
				Если НайденныеСтроки.Количество() Тогда 
					Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
				Иначе
					ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоКонтрагенту1.Параметры, ВыборкаПоКонтрагенту);
			ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту1);
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Прочие строительные программы. Прочие подрядчики.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК)))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В (&БюджетныеСтатьиПРСТ010203))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Строительство);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиСтроительство);
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Программы ДКСС.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В(&БюджетныеСтатьиПРСТ010203)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Строительство);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Х-ТТК. Эксплуатация.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКапвложения))
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКосвенныеПрочие))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Эксплуатация);
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиЭксплуатация);
	Запрос.УстановитьПараметр("БюджетныеСтатьиКапвложения", БюджетныеСтатьиКапвложения);
	Запрос.УстановитьПараметр("БюджетныеСтатьиКосвенныеПрочие", БюджетныеСтатьиКосвенныеПрочие);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоКонтрагенту = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			ВыборкаПоСтрокам = ВыборкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
				ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
				НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
				
				Если НайденныеСтроки.Количество() Тогда 
					Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
				Иначе
					ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоКонтрагенту2.Параметры, ВыборкаПоКонтрагенту);
			ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту2);
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Х-ТТК. Связь.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК))
	|	И (абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|				И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКапвложения))
	|				И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКосвенныеПрочие))
	|			ИЛИ ВЫБОР
	|				КОГДА абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ_Строительство
	|						И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиСтроительство)
	|						И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В (&БюджетныеСтатьиПРСТ010203))
	|					ТОГДА ИСТИНА
	|				КОГДА (абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ_Эксплуатация
	|						ИЛИ абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ)
	|						И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКапвложения))
	|						И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКосвенныеПрочие))
	|					ТОГДА ИСТИНА
	|				КОГДА абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиКапвложения)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ = ЛОЖЬ)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Связь);
	Запрос.УстановитьПараметр("ЦФУ_Строительство", ЦФУ_Строительство);
	Запрос.УстановитьПараметр("ЦФУ_Эксплуатация",  ЦФУ_Эксплуатация);
	Запрос.УстановитьПараметр("БюджетныеСтатьиСтроительство", БюджетныеСтатьиСтроительство);
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиСвязь);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоКонтрагенту = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			ВыборкаПоСтрокам = ВыборкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
				ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
				НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
				
				Если НайденныеСтроки.Количество() Тогда 
					Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
				Иначе
					ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоКонтрагенту3.Параметры, ВыборкаПоКонтрагенту);
			ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту3);
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Операционные расходы. Связь.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ (&БюджетныеСтатьиПРСЭ0101_0102))
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК)))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Связь);
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиСвязь);
	Запрос.УстановитьПараметр("БюджетныеСтатьиПРСЭ0101_0102", БюджетныеСтатьиПРСЭ0101_0102);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Операционные расходы. Системная интеграция";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиСИ);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Операционные расходы. Эксплуатация.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК)))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ЦФУ = &ЦФУ
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ЦФУ", ЦФУ_Эксплуатация);
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиЭксплуатация);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "РЖД. Аренда сети и возмещение ТО.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&БюджетныеСтатьиПРСЭ0101_0102)
	|	И абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов = ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.РЖДбезДЗО)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Административные и внеоперационные расходы.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК)))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.СтатьяДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РасчетыПоНалогамИСборам))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиКосвенныеПрочие);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Налоги. Дивиденды.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Счет.СтатьяДвиженияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РасчетыПоНалогамИСборам)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыОперационнаяДеятельность = ИтогиРасходыОперационнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьИтогиПоВидуДеятельности.Параметры.Сумма = ИтогиРасходыОперационнаяДеятельность;
	ОбластьИтогиПоВидуДеятельности.Параметры.Заголовок = "ИТОГО ОПЕРАЦИОННАЯ ДЕЯТЕЛЬНОСТЬ:";
	ТабличныйДокумент.Вывести(ОбластьИтогиПоВидуДеятельности);
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "ИНВЕСТИЦИОННАЯ ДЕЯТЕЛЬНОСТЬ.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Х-ТТК. Капвложения.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Контрагент";
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиКапвложения);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоКонтрагенту = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			ВыборкаПоСтрокам = ВыборкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
				ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
				НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
				
				Если НайденныеСтроки.Количество() Тогда 
					Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
				Иначе
					ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоКонтрагенту4.Параметры, ВыборкаПоКонтрагенту);
			ТабличныйДокумент.Вывести(ОбластьИтогиПоКонтрагенту4);
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыИнвестиционнаяДеятельность = ИтогиРасходыИнвестиционнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьЗаголовокРазмер10.Параметры.Заголовок = "Капитальные вложения. Прочие.";
	ТабличныйДокумент.Вывести(ОбластьЗаголовокРазмер10);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки,
	|	абс_ПлатежСоставПлатежей.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП = """"
	|			ТОГДА абс_ПлатежСоставПлатежей.Контрагент.Наименование
	|		ИНАЧЕ абс_ПлатежСоставПлатежей.Контрагент.абс_НаименованиеПП
	|	КОНЕЦ КАК КонтрагентНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО,
	|	абс_ПлатежСоставПлатежей.Ссылка.ЦФО.абс_НаименованиеПП КАК ЦФОНаименованиеПП,
	|	абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья,
	|	абс_ПлатежСоставПлатежей.СуммаПлатежа КАК Сумма,
	|	абс_ПлатежСоставПлатежей.ОснованиеПлатежа,
	|	абс_ПлатежСоставПлатежей.НазначениеПлатежа,
	|	абс_ПлатежСоставПлатежей.Ссылка.НомерЖурнала КАК НомерНедели,
	|	абс_ПлатежСоставПлатежей.Счет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И (НЕ абс_ПлатежСоставПлатежей.Счет.Контрагент.абс_ТипыКонтрагентов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.абс_ТипыКонтрагентов.ХТТК)))
	|	И абс_ПлатежСоставПлатежей.Ссылка.БюджетнаяСтатья В ИЕРАРХИИ(&ГруппаСтатейОборотов)
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеПП,
	|	Сумма УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ГруппаСтатейОборотов", БюджетныеСтатьиКапвложения);
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ВыборкаПоСтрокам = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоКонтрагенту.Параметры, ВыборкаПоСтрокам);
			ТабличныйДокумент.Вывести(ОбластьСтрокаПоКонтрагенту);
			НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", ВыборкаПоСтрокам.НомерСтроки, ВыборкаПоСтрокам.Документ));
			
			Если НайденныеСтроки.Количество() Тогда 
				Сообщить("Строка №" + ВыборкаПоСтрокам.НомерСтроки + " из документа " + ВыборкаПоСтрокам.Документ + " уже выводилась!");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыведенныеСтроки.Добавить(), ВыборкаПоСтрокам);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогиПоВиду.Параметры.Сумма = ВыборкаОбщая.Сумма;
		ИтогиРасходыИнвестиционнаяДеятельность = ИтогиРасходыИнвестиционнаяДеятельность + ВыборкаОбщая.Сумма; 
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	Иначе
		
		ОбластьИтогиПоВиду.Параметры.Сумма = 0;
		ТабличныйДокумент.Вывести(ОбластьИтогиПоВиду);
		
	КонецЕсли;
	
	ОбластьИтогиПоВидуДеятельности.Параметры.Сумма = ИтогиРасходыИнвестиционнаяДеятельность;
	ОбластьИтогиПоВидуДеятельности.Параметры.Заголовок = "ИТОГО ИНВЕСТИЦИОННАЯ ДЕЯТЕЛЬНОСТЬ:";
	ТабличныйДокумент.Вывести(ОбластьИтогиПоВидуДеятельности);
	
	ТабличныйДокумент.Вывести(ОбластьГруппаФинансоваяДеятельность);
	
	ОбластьПодвал.Параметры.Сумма = ИтогиРасходыИнвестиционнаяДеятельность + ИтогиРасходыОперационнаяДеятельность;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ПлатежСоставПлатежей.Ссылка КАК Документ,
	|	абс_ПлатежСоставПлатежей.НомерСтроки
	|ИЗ
	|	Документ.абс_Платеж.СоставПлатежей КАК абс_ПлатежСоставПлатежей
	|ГДЕ
	|	(НЕ абс_ПлатежСоставПлатежей.Ссылка.ПометкаУдаления)
	|	И (НЕ абс_ПлатежСоставПлатежей.Ссылка.СтатусПлана = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыПланаПлатежей.Разутвержден))
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаНачала >= &ДатаНачала
	|	И абс_ПлатежСоставПлатежей.Ссылка.ДатаОкончания <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаКон", НачалоГода(ДатаНачала));
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШапкаВыведена = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ВыведенныеСтроки.НайтиСтроки(Новый Структура("НомерСтроки, Документ", Выборка.НомерСтроки, Выборка.Документ));
		
		Если НЕ НайденныеСтроки.Количество() Тогда
			//Сообщить("Строка №" + Выборка.НомерСтроки + " из документа " + Выборка.Документ + " не выводилась на печать!");
			
			Если НЕ ШапкаВыведена Тогда
				ТабличныйДокумент.Вывести(ОбластьШапкаНераспределенные);
				ШапкаВыведена = Истина;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаНераспределенные.Параметры, Выборка);
			ТабличныйДокумент.Вывести(ОбластьСтрокаНераспределенные);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабличныйДокумент,,, "План платежей за период " + Формат(ДатаНачала,  "ДФ=MM.dd") + "/" + Формат(ДатаОкончания, "ДФ=MM.dd"));
	
КонецПроцедуры
